sim8/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (2 0 0)
    (2 0.3 0)
    (0 0.3 0)
    (0 0 0.1)
    (2 0 0.1)
    (2 0.3 0.1)
    (0 0.3 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 30 1) simpleGrading (1 1 1)
);

defaultPatch
{
    name FaB;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (2 3 7 6)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
);


// ************************************************************************* //
